/*
 * Створіть узагальнений клас MyClass, що містить статичний фабричний метод – T FacrotyMethod(),
   який породжуватиме екземпляри типу, вказаного як параметр типу (покажчика місця заповнення 
   типом – Т). Яким має бути тип, що підставляється під T?
   
   Тип, що підставляється під Т, має бути таким, що може бути використаний як тип поверненого 
   значення фабрисного методу. Мова йде про статичний фабричний метод, що повертає екземпляри 
   типу вказанного як параметр типу Т, відповіжним типом для Т може бути будь-який класс або 
   тип, який ми хочемо створити за допомогаю цього методу.
   Якщо ми хочемо створювати екземпляри класу "MyClass" за допомогою фабричного методу, то Т
   може бути самим классом "MyClass". Отже, узагальнений клас MyClass зі статичним фабричним 
   методом може виглядати так:
*/

class MyClass
{
    // Статичний фабричний метод
    public static T FactoryMethod<T>() where T : new()
    {
        return new T();
    }
}
/*
 * У цьому прикладі FactoryMethod<T>() є статичним методом, який створює новий екземпляр типу,
 * який підставляється під параметр типу T, за умови, що цей тип має публічний конструктор без
 * параметрів (where T : new()). Таким чином, T може бути будь-яким класом або структурою,
 * яку можна створити безпосередньо через конструктор за допомогою new T().
 */

class Program
{
    static void Main()
    {
        MyClass.FactoryMethod<MyClass>();
    }
    
}