namespace Task2;

//Реалізуйте у найпростішому наближенні можливість використання екземпляра
// для створення парку машин. 
// Мінімально необхідний інтерфейс взаємодії з екземпляром повинен включати 
// метод додавання машин з назвою машини і року її випуску,
// індексатор для отримання значення елемента за вказаним індексом і 
// властивість тільки для читання для отримання загальної кількості елементів. 
// Створіть спосіб видалення всіх машин автопарку.
public class Car
{
    public string Name { get; set; }
    public int Year { get; set; }

    public Car(string name, int year)
    {
        Name = name;
        Year = year;
    }

    public override string ToString()
    {
        return $"{Name}, {Year}";
    }
}